#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
module.lambda_layer_s3.data.external.archive_prepare[0]: Reading...
module.charing_history_exporter_function.data.external.archive_prepare[0]: Reading...
module.vehicle_data_function.data.external.archive_prepare[0]: Reading...
module.history_slicer_function.data.external.archive_prepare[0]: Reading...
module.history_slicer_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.vehicle_data_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.vehicle_data_function.local_file.archive_plan[0]: Refreshing state... [id=9c3375b9f10cd4d6408f1a46008846e35e5ab42f]
module.history_slicer_function.local_file.archive_plan[0]: Refreshing state... [id=8b0f25e2036f08de617f38c1f28b9110d52161fe]
module.lambda_layer_s3.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.charing_history_exporter_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_layer_s3.local_file.archive_plan[0]: Refreshing state... [id=8939801dc44e8591338679f966e426aabf94a82b]
module.charing_history_exporter_function.local_file.archive_plan[0]: Refreshing state... [id=4fa2966c4b8f2ddcca52662d61cb3d3ee2a78322]
module.history_slicer_function.null_resource.archive[0]: Refreshing state... [id=4857783311281573009]
module.vehicle_data_function.null_resource.archive[0]: Refreshing state... [id=5298783820381943919]
module.lambda_layer_s3.null_resource.archive[0]: Refreshing state... [id=6871394855564806572]
module.charing_history_exporter_function.null_resource.archive[0]: Refreshing state... [id=8473535557013312602]
aws_ssm_parameter.email: Refreshing state... [id=/tesla-data-exporter/email]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Reading...
aws_cloudwatch_event_rule.exporter: Refreshing state... [id=tesla-data-exporter20231001174846219100000001]
data.aws_region.current: Reading...
aws_ssm_parameter.refresh_token: Refreshing state... [id=/tesla-data-exporter/refresh_token]
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.history_slicer_function.data.aws_caller_identity.current: Reading...
module.vehicle_data.aws_dynamodb_table.this[0]: Refreshing state... [id=vehicle-data]
module.charing_history_exporter_function.data.aws_partition.current: Reading...
module.vehicle_data_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=tesla-data-exporter]
module.vehicle_data_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
aws_s3_bucket.this: Refreshing state... [id=tesla-data-exporter20230820121120532200000002]
module.charing_history_exporter_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.history_slicer_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.charing_history_exporter_function.data.aws_region.current: Reading...
module.history_slicer_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.charing_history_exporter_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_layer_s3.data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_region.current: Reading...
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vehicle_data_function.data.aws_partition.current: Reading...
module.vehicle_data_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_layer_s3.data.aws_partition.current: Reading...
module.lambda_layer_s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.history_slicer_function.data.aws_partition.current: Reading...
module.history_slicer_function.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=402889198055]
module.charing_history_exporter_function.data.aws_caller_identity.current: Reading...
module.history_slicer_function.data.aws_caller_identity.current: Read complete after 1s [id=402889198055]
module.vehicle_data_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/vehicle-data]
module.lambda_layer_s3.data.aws_caller_identity.current: Read complete after 1s [id=402889198055]
module.s3_bucket.data.aws_caller_identity.current: Reading...
module.charing_history_exporter_function.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=tde-slicer]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Read complete after 1s [id=7eb60e703ce476dda79c3026f9e3373dcf661ed201b4d53471100e2f29a9e43d]
module.vehicle_data_function.data.aws_region.current: Reading...
module.vehicle_data_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.charing_history_exporter_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tesla-data-exporter]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.history_slicer_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/history-slicer]
module.history_slicer_function.data.aws_region.current: Reading...
module.history_slicer_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.charing_history_exporter_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.charing_history_exporter_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.lambda_layer_s3.data.aws_region.current: Reading...
module.lambda_layer_s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.s3_bucket.data.aws_partition.current: Reading...
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.vehicle_data_function.data.aws_caller_identity.current: Reading...
module.vehicle_data_function.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.vehicle_data_function.aws_iam_role.lambda[0]: Refreshing state... [id=vehicle-data]
module.history_slicer_function.aws_iam_role.lambda[0]: Refreshing state... [id=history-slicer]
module.charing_history_exporter_function.aws_iam_role.lambda[0]: Refreshing state... [id=tesla-data-exporter]
data.aws_iam_policy_document.vehicle_data: Reading...
data.aws_iam_policy_document.vehicle_data: Read complete after 0s [id=1837894490]
module.vehicle_data_function.data.aws_iam_policy_document.logs[0]: Reading...
module.vehicle_data_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4225016675]
module.vehicle_data_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/vehicle-data-logs]
module.history_slicer_function.data.aws_iam_policy_document.logs[0]: Reading...
module.history_slicer_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4275475925]
module.history_slicer_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/history-slicer-logs]
module.charing_history_exporter_function.data.aws_iam_policy_document.logs[0]: Reading...
module.charing_history_exporter_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=290343876]
module.charing_history_exporter_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/tesla-data-exporter-logs]
module.vehicle_data_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=vehicle-data-20231001174846802700000003]
module.charing_history_exporter_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tesla-data-exporter-20231001175840578300000002]
module.history_slicer_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=history-slicer-20231001174846812600000004]
data.aws_iam_policy_document.history_slicer: Reading...
data.aws_iam_policy_document.history_exporter: Reading...
module.s3_bucket.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=tesla-data-exporter]
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=tesla-data-exporter]
data.aws_iam_policy_document.history_exporter: Read complete after 0s [id=3850528508]
data.aws_iam_policy_document.history_slicer: Read complete after 0s [id=3487884030]
module.s3_bucket.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=tesla-data-exporter]
module.lambda_layer_s3.aws_s3_object.lambda_package[0]: Refreshing state... [id=lambda-builds/454920f1aaa4f7089b0b8cd7aa79a674a095568167518f6ca68a3472d7858c7a.zip]
module.s3_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=tesla-data-exporter,private]
module.lambda_layer_s3.aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:1]
module.charing_history_exporter_function.aws_lambda_function.this[0]: Refreshing state... [id=tesla-data-exporter]
module.vehicle_data_function.aws_lambda_function.this[0]: Refreshing state... [id=vehicle-data]
module.history_slicer_function.aws_lambda_function.this[0]: Refreshing state... [id=history-slicer]
module.charing_history_exporter_function.aws_lambda_permission.current_version_triggers["EveryEightHours"]: Refreshing state... [id=EveryEightHours]
aws_cloudwatch_event_target.exporter: Refreshing state... [id=tesla-data-exporter20231001174846219100000001-terraform-20231001175918661000000004]
module.charing_history_exporter_function.aws_lambda_permission.unqualified_alias_triggers["EveryEightHours"]: Refreshing state... [id=EveryEightHours]
module.history_slicer_function.aws_lambda_permission.unqualified_alias_triggers["s3"]: Refreshing state... [id=s3]
module.history_slicer_function.aws_lambda_permission.current_version_triggers["s3"]: Refreshing state... [id=s3]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.charing_history_exporter_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "tesla-data-exporter"
      ~ last_modified                  = "2023-10-01T17:59:11.217+0000" -> "2023-10-01T17:59:18.727+0000"
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.history_slicer_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "history-slicer"
      ~ last_modified                  = "2023-10-01T17:59:00.547+0000" -> "2023-10-01T17:59:11.182+0000"
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.vehicle_data will be created
  + resource "aws_cloudwatch_event_rule" "vehicle_data" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = (known after apply)
      + name_prefix         = "tesla-data-exporter"
      + schedule_expression = "cron(0 5 * * ? *)"
      + tags_all            = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
    }

  # aws_s3_bucket_notification.slicer will be created
  + resource "aws_s3_bucket_notification" "slicer" {
      + bucket      = "tesla-data-exporter20230820121120532200000002"
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "charge_history/"
          + id                  = (known after apply)
          + lambda_function_arn = "arn:aws:lambda:us-east-1:402889198055:function:history-slicer"
        }
    }

  # module.charing_history_exporter_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "tesla-data-exporter"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:1",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:402889198055:function:tesla-data-exporter:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:402889198055:function:tesla-data-exporter:1/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.charing_history_exporter_function.aws_lambda_permission.current_version_triggers["EveryEightHours"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "EveryEightHours" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.charing_history_exporter_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8473535557013312602" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1696183114326783800" -> "1696272855978338000"
            # (1 unchanged element hidden)
        }
    }

  # module.history_slicer_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "history-slicer"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:1",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:402889198055:function:history-slicer:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:402889198055:function:history-slicer:1/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.history_slicer_function.aws_lambda_permission.current_version_triggers["s3"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "s3" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.history_slicer_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4857783311281573009" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1696183114353423200" -> "1696272855904578000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:1" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-10-01T17:58:51.642+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies" -> (known after apply)
      ~ s3_key                      = "lambda-builds/454920f1aaa4f7089b0b8cd7aa79a674a095568167518f6ca68a3472d7858c7a.zip" -> "lambda-builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip" # forces replacement
      ~ s3_object_version           = "9KMyJVN5lgW52hrDGwedEKvMZLxRCQDd" # forces replacement -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "7mXKNXBYZa67E+G8kcSLEYY7ATAuoumerKyLn3NxUvE=" -> (known after apply)
      ~ source_code_size            = 14504026 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "2aeb77010a7f000a83d344019011a732-3" -> (known after apply)
      ~ id                     = "lambda-builds/454920f1aaa4f7089b0b8cd7aa79a674a095568167518f6ca68a3472d7858c7a.zip" -> (known after apply)
      ~ key                    = "lambda-builds/454920f1aaa4f7089b0b8cd7aa79a674a095568167518f6ca68a3472d7858c7a.zip" -> "lambda-builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "./.terraform/lambda_builds/454920f1aaa4f7089b0b8cd7aa79a674a095568167518f6ca68a3472d7858c7a.zip" -> "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip"
      - tags                   = {} -> null
      ~ version_id             = "9KMyJVN5lgW52hrDGwedEKvMZLxRCQDd" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "./.terraform/lambda_builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "../lambda/packages",
                      + null,
                    ],
                ]
              + filename      = "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6871394855564806572" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "./.terraform/lambda_builds/454920f1aaa4f7089b0b8cd7aa79a674a095568167518f6ca68a3472d7858c7a.zip" -> "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip"
          ~ "timestamp" = "1696183114918228000" -> "1696272855953892000"
        }
    }

  # module.vehicle_data_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "./.terraform/lambda_builds/f7e4eb4716dc731fe96946ed23cd51b20fc481e6f754db5533900dc9941f4487.zip" -> "./.terraform/lambda_builds/d137dd68506f2aa4374b8fa3e3fc6b0000985bf92660807564db6acbff7e939a.zip"
        id                             = "vehicle-data"
      ~ last_modified                  = "2023-10-01T17:58:51.841+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:1",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:402889198055:function:vehicle-data:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:402889198055:function:vehicle-data:1/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vehicle_data_function.aws_lambda_permission.current_version_triggers["AtMidnight"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "vehicle-data"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = (known after apply)
      + statement_id        = "AtMidnight"
      + statement_id_prefix = (known after apply)
    }

  # module.vehicle_data_function.aws_lambda_permission.unqualified_alias_triggers["AtMidnight"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "vehicle-data"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AtMidnight"
      + statement_id_prefix = (known after apply)
    }

  # module.vehicle_data_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "./.terraform/lambda_builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "../lambda/src/mileage_tracker.py",
                      + null,
                    ],
                ]
              + filename      = "./.terraform/lambda_builds/d137dd68506f2aa4374b8fa3e3fc6b0000985bf92660807564db6acbff7e939a.zip"
              + runtime       = "python3.10"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./.terraform/lambda_builds/d137dd68506f2aa4374b8fa3e3fc6b0000985bf92660807564db6acbff7e939a.plan.json"
      + id                   = (known after apply)
    }

  # module.vehicle_data_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5298783820381943919" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "./.terraform/lambda_builds/f7e4eb4716dc731fe96946ed23cd51b20fc481e6f754db5533900dc9941f4487.zip" -> "./.terraform/lambda_builds/d137dd68506f2aa4374b8fa3e3fc6b0000985bf92660807564db6acbff7e939a.zip"
          ~ "timestamp" = "1696183114387028000" -> "1696272855948047000"
        }
    }

Plan: 14 to add, 3 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @cvanlaw, Action: `pull_request`*